{"class_name": "Tokenizer", "config": {"num_words": 1000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 129, "word_counts": "{\"hello\": 2, \"hi\": 2, \"hey\": 2, \"howdy\": 1, \"greetings\": 1, \"good\": 5, \"morning\": 1, \"afternoon\": 1, \"evening\": 1, \"there\": 3, \"what's\": 1, \"up\": 1, \"can\": 2, \"you\": 5, \"help\": 9, \"me\": 4, \"bye\": 3, \"goodbye\": 1, \"farewell\": 1, \"take\": 2, \"care\": 3, \"until\": 1, \"next\": 1, \"time\": 3, \"catch\": 1, \"later\": 2, \"thank\": 2, \"thanks\": 2, \"appreciate\": 1, \"it\": 2, \"so\": 1, \"much\": 2, \"a\": 8, \"lot\": 1, \"appreciated\": 1, \"sorry\": 2, \"my\": 3, \"apologies\": 1, \"apologize\": 1, \"i'm\": 1, \"great\": 1, \"job\": 2, \"well\": 2, \"done\": 1, \"awesome\": 1, \"fantastic\": 1, \"amazing\": 1, \"work\": 1, \"excellent\": 1, \"not\": 1, \"disappointed\": 1, \"unsatisfied\": 1, \"poor\": 1, \"service\": 1, \"needs\": 1, \"improvement\": 1, \"could\": 1, \"be\": 1, \"better\": 1, \"i\": 3, \"need\": 1, \"assistance\": 3, \"support\": 3, \"movie\": 2, \"suggestions\": 4, \"recommend\": 4, \"what\": 4, \"should\": 2, \"watch\": 2, \"best\": 2, \"movies\": 2, \"movi\": 1, \"tv\": 4, \"show\": 1, \"recommendations\": 2, \"series\": 1, \"to\": 4, \"on\": 1, \"shows\": 1, \"is\": 1, \"ip\": 4, \"address\": 2, \"lookup\": 1, \"find\": 1, \"information\": 1, \"email\": 4, \"send\": 1, \"an\": 1, \"issues\": 1, \"create\": 1, \"note\": 3, \"write\": 1, \"taking\": 2, \"remind\": 2, \"set\": 1, \"medicine\": 3, \"reminder\": 1, \"schedule\": 1, \"health\": 3, \"reminders\": 1, \"start\": 1, \"stopwatch\": 2, \"timer\": 1, \"measure\": 1, \"elapsed\": 1, \"math\": 1, \"solve\": 1, \"equations\": 1, \"mathematics\": 1, \"calculate\": 1, \"book\": 2, \"books\": 1, \"read\": 2, \"fitness\": 1, \"advice\": 8, \"workout\": 1, \"tips\": 7, \"exercise\": 1, \"healthy\": 1, \"habits\": 1, \"travel\": 2, \"places\": 1, \"visit\": 1, \"destination\": 1, \"ideas\": 1, \"learning\": 3, \"resources\": 1, \"study\": 2, \"education\": 1, \"academic\": 1, \"pet\": 2, \"animal\": 1, \"of\": 1, \"pets\": 1, \"online\": 1, \"shopping\": 2, \"buying\": 1, \"something\": 1, \"product\": 1, \"search\": 1, \"career\": 2, \"guidance\": 1, \"change\": 1, \"professional\": 1, \"development\": 1, \"relationship\": 2, \"love\": 1, \"dating\": 1, \"problems\": 1, \"mental\": 1, \"coping\": 1, \"strategies\": 1, \"stress\": 1, \"relief\": 1, \"emotional\": 1, \"being\": 1, \"language\": 3, \"practice\": 1, \"new\": 1, \"languages\": 1, \"financial\": 1, \"planning\": 1, \"money\": 1, \"management\": 1, \"investment\": 1, \"budgeting\": 1, \"none\": 1, \"leave\": 1, \"no\": 1, \"nothing\": 1}", "word_docs": "{\"hello\": 2, \"hi\": 2, \"hey\": 2, \"howdy\": 1, \"greetings\": 1, \"morning\": 1, \"good\": 5, \"afternoon\": 1, \"evening\": 1, \"there\": 3, \"what's\": 1, \"up\": 1, \"help\": 9, \"can\": 2, \"me\": 4, \"you\": 5, \"bye\": 2, \"goodbye\": 1, \"farewell\": 1, \"care\": 3, \"take\": 2, \"next\": 1, \"until\": 1, \"time\": 3, \"catch\": 1, \"later\": 2, \"thank\": 2, \"thanks\": 2, \"appreciate\": 1, \"it\": 2, \"so\": 1, \"much\": 2, \"lot\": 1, \"a\": 8, \"appreciated\": 1, \"sorry\": 2, \"my\": 3, \"apologies\": 1, \"apologize\": 1, \"i'm\": 1, \"job\": 2, \"great\": 1, \"done\": 1, \"well\": 2, \"awesome\": 1, \"fantastic\": 1, \"work\": 1, \"amazing\": 1, \"excellent\": 1, \"not\": 1, \"disappointed\": 1, \"unsatisfied\": 1, \"service\": 1, \"poor\": 1, \"improvement\": 1, \"needs\": 1, \"could\": 1, \"be\": 1, \"better\": 1, \"need\": 1, \"assistance\": 3, \"i\": 3, \"support\": 3, \"movie\": 2, \"suggestions\": 4, \"recommend\": 4, \"watch\": 2, \"what\": 4, \"should\": 2, \"movies\": 2, \"best\": 2, \"movi\": 1, \"show\": 1, \"recommendations\": 2, \"tv\": 4, \"series\": 1, \"to\": 4, \"on\": 1, \"shows\": 1, \"ip\": 4, \"address\": 2, \"is\": 1, \"lookup\": 1, \"find\": 1, \"information\": 1, \"email\": 4, \"send\": 1, \"an\": 1, \"issues\": 1, \"create\": 1, \"note\": 3, \"write\": 1, \"taking\": 2, \"remind\": 2, \"medicine\": 3, \"set\": 1, \"reminder\": 1, \"schedule\": 1, \"health\": 3, \"reminders\": 1, \"stopwatch\": 2, \"start\": 1, \"timer\": 1, \"measure\": 1, \"elapsed\": 1, \"math\": 1, \"solve\": 1, \"equations\": 1, \"mathematics\": 1, \"calculate\": 1, \"book\": 2, \"books\": 1, \"read\": 2, \"fitness\": 1, \"advice\": 8, \"tips\": 7, \"workout\": 1, \"exercise\": 1, \"habits\": 1, \"healthy\": 1, \"travel\": 2, \"visit\": 1, \"places\": 1, \"destination\": 1, \"ideas\": 1, \"learning\": 3, \"resources\": 1, \"study\": 2, \"education\": 1, \"academic\": 1, \"pet\": 2, \"animal\": 1, \"of\": 1, \"pets\": 1, \"online\": 1, \"shopping\": 2, \"something\": 1, \"buying\": 1, \"product\": 1, \"search\": 1, \"guidance\": 1, \"career\": 2, \"change\": 1, \"development\": 1, \"professional\": 1, \"relationship\": 2, \"love\": 1, \"dating\": 1, \"problems\": 1, \"mental\": 1, \"coping\": 1, \"strategies\": 1, \"stress\": 1, \"relief\": 1, \"being\": 1, \"emotional\": 1, \"language\": 3, \"practice\": 1, \"new\": 1, \"languages\": 1, \"planning\": 1, \"financial\": 1, \"money\": 1, \"management\": 1, \"investment\": 1, \"budgeting\": 1, \"none\": 1, \"leave\": 1, \"no\": 1, \"nothing\": 1}", "index_docs": "{\"29\": 2, \"30\": 2, \"31\": 2, \"60\": 1, \"61\": 1, \"62\": 1, \"6\": 5, \"63\": 1, \"64\": 1, \"16\": 3, \"65\": 1, \"66\": 1, \"2\": 9, \"32\": 2, \"8\": 4, \"7\": 5, \"17\": 2, \"67\": 1, \"68\": 1, \"18\": 3, \"33\": 2, \"70\": 1, \"69\": 1, \"19\": 3, \"71\": 1, \"34\": 2, \"35\": 2, \"36\": 2, \"72\": 1, \"37\": 2, \"73\": 1, \"38\": 2, \"74\": 1, \"3\": 8, \"75\": 1, \"39\": 2, \"20\": 3, \"76\": 1, \"77\": 1, \"78\": 1, \"40\": 2, \"79\": 1, \"80\": 1, \"41\": 2, \"81\": 1, \"82\": 1, \"84\": 1, \"83\": 1, \"85\": 1, \"86\": 1, \"87\": 1, \"88\": 1, \"90\": 1, \"89\": 1, \"92\": 1, \"91\": 1, \"93\": 1, \"94\": 1, \"95\": 1, \"96\": 1, \"22\": 3, \"21\": 3, \"23\": 3, \"42\": 2, \"9\": 4, \"10\": 4, \"44\": 2, \"11\": 4, \"43\": 2, \"46\": 2, \"45\": 2, \"97\": 1, \"98\": 1, \"47\": 2, \"12\": 4, \"99\": 1, \"13\": 4, \"100\": 1, \"101\": 1, \"14\": 4, \"48\": 2, \"102\": 1, \"103\": 1, \"104\": 1, \"105\": 1, \"15\": 4, \"106\": 1, \"107\": 1, \"108\": 1, \"109\": 1, \"24\": 3, \"110\": 1, \"49\": 2, \"50\": 2, \"25\": 3, \"111\": 1, \"112\": 1, \"113\": 1, \"26\": 3, \"114\": 1, \"51\": 2, \"115\": 1, \"116\": 1, \"117\": 1, \"118\": 1, \"119\": 1, \"120\": 1, \"121\": 1, \"122\": 1, \"123\": 1, \"52\": 2, \"124\": 1, \"53\": 2, \"125\": 1, \"4\": 8, \"5\": 7, \"126\": 1, \"127\": 1, \"129\": 1, \"128\": 1, \"54\": 2, \"131\": 1, \"130\": 1, \"132\": 1, \"133\": 1, \"27\": 3, \"134\": 1, \"55\": 2, \"135\": 1, \"136\": 1, \"56\": 2, \"137\": 1, \"138\": 1, \"139\": 1, \"140\": 1, \"57\": 2, \"142\": 1, \"141\": 1, \"143\": 1, \"144\": 1, \"145\": 1, \"58\": 2, \"146\": 1, \"148\": 1, \"147\": 1, \"59\": 2, \"149\": 1, \"150\": 1, \"151\": 1, \"152\": 1, \"153\": 1, \"154\": 1, \"155\": 1, \"156\": 1, \"158\": 1, \"157\": 1, \"28\": 3, \"159\": 1, \"160\": 1, \"161\": 1, \"163\": 1, \"162\": 1, \"164\": 1, \"165\": 1, \"166\": 1, \"167\": 1, \"168\": 1, \"169\": 1, \"170\": 1, \"171\": 1}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"help\", \"3\": \"a\", \"4\": \"advice\", \"5\": \"tips\", \"6\": \"good\", \"7\": \"you\", \"8\": \"me\", \"9\": \"suggestions\", \"10\": \"recommend\", \"11\": \"what\", \"12\": \"tv\", \"13\": \"to\", \"14\": \"ip\", \"15\": \"email\", \"16\": \"there\", \"17\": \"bye\", \"18\": \"care\", \"19\": \"time\", \"20\": \"my\", \"21\": \"i\", \"22\": \"assistance\", \"23\": \"support\", \"24\": \"note\", \"25\": \"medicine\", \"26\": \"health\", \"27\": \"learning\", \"28\": \"language\", \"29\": \"hello\", \"30\": \"hi\", \"31\": \"hey\", \"32\": \"can\", \"33\": \"take\", \"34\": \"later\", \"35\": \"thank\", \"36\": \"thanks\", \"37\": \"it\", \"38\": \"much\", \"39\": \"sorry\", \"40\": \"job\", \"41\": \"well\", \"42\": \"movie\", \"43\": \"should\", \"44\": \"watch\", \"45\": \"best\", \"46\": \"movies\", \"47\": \"recommendations\", \"48\": \"address\", \"49\": \"taking\", \"50\": \"remind\", \"51\": \"stopwatch\", \"52\": \"book\", \"53\": \"read\", \"54\": \"travel\", \"55\": \"study\", \"56\": \"pet\", \"57\": \"shopping\", \"58\": \"career\", \"59\": \"relationship\", \"60\": \"howdy\", \"61\": \"greetings\", \"62\": \"morning\", \"63\": \"afternoon\", \"64\": \"evening\", \"65\": \"what's\", \"66\": \"up\", \"67\": \"goodbye\", \"68\": \"farewell\", \"69\": \"until\", \"70\": \"next\", \"71\": \"catch\", \"72\": \"appreciate\", \"73\": \"so\", \"74\": \"lot\", \"75\": \"appreciated\", \"76\": \"apologies\", \"77\": \"apologize\", \"78\": \"i'm\", \"79\": \"great\", \"80\": \"done\", \"81\": \"awesome\", \"82\": \"fantastic\", \"83\": \"amazing\", \"84\": \"work\", \"85\": \"excellent\", \"86\": \"not\", \"87\": \"disappointed\", \"88\": \"unsatisfied\", \"89\": \"poor\", \"90\": \"service\", \"91\": \"needs\", \"92\": \"improvement\", \"93\": \"could\", \"94\": \"be\", \"95\": \"better\", \"96\": \"need\", \"97\": \"movi\", \"98\": \"show\", \"99\": \"series\", \"100\": \"on\", \"101\": \"shows\", \"102\": \"is\", \"103\": \"lookup\", \"104\": \"find\", \"105\": \"information\", \"106\": \"send\", \"107\": \"an\", \"108\": \"issues\", \"109\": \"create\", \"110\": \"write\", \"111\": \"set\", \"112\": \"reminder\", \"113\": \"schedule\", \"114\": \"reminders\", \"115\": \"start\", \"116\": \"timer\", \"117\": \"measure\", \"118\": \"elapsed\", \"119\": \"math\", \"120\": \"solve\", \"121\": \"equations\", \"122\": \"mathematics\", \"123\": \"calculate\", \"124\": \"books\", \"125\": \"fitness\", \"126\": \"workout\", \"127\": \"exercise\", \"128\": \"healthy\", \"129\": \"habits\", \"130\": \"places\", \"131\": \"visit\", \"132\": \"destination\", \"133\": \"ideas\", \"134\": \"resources\", \"135\": \"education\", \"136\": \"academic\", \"137\": \"animal\", \"138\": \"of\", \"139\": \"pets\", \"140\": \"online\", \"141\": \"buying\", \"142\": \"something\", \"143\": \"product\", \"144\": \"search\", \"145\": \"guidance\", \"146\": \"change\", \"147\": \"professional\", \"148\": \"development\", \"149\": \"love\", \"150\": \"dating\", \"151\": \"problems\", \"152\": \"mental\", \"153\": \"coping\", \"154\": \"strategies\", \"155\": \"stress\", \"156\": \"relief\", \"157\": \"emotional\", \"158\": \"being\", \"159\": \"practice\", \"160\": \"new\", \"161\": \"languages\", \"162\": \"financial\", \"163\": \"planning\", \"164\": \"money\", \"165\": \"management\", \"166\": \"investment\", \"167\": \"budgeting\", \"168\": \"none\", \"169\": \"leave\", \"170\": \"no\", \"171\": \"nothing\"}", "word_index": "{\"<OOV>\": 1, \"help\": 2, \"a\": 3, \"advice\": 4, \"tips\": 5, \"good\": 6, \"you\": 7, \"me\": 8, \"suggestions\": 9, \"recommend\": 10, \"what\": 11, \"tv\": 12, \"to\": 13, \"ip\": 14, \"email\": 15, \"there\": 16, \"bye\": 17, \"care\": 18, \"time\": 19, \"my\": 20, \"i\": 21, \"assistance\": 22, \"support\": 23, \"note\": 24, \"medicine\": 25, \"health\": 26, \"learning\": 27, \"language\": 28, \"hello\": 29, \"hi\": 30, \"hey\": 31, \"can\": 32, \"take\": 33, \"later\": 34, \"thank\": 35, \"thanks\": 36, \"it\": 37, \"much\": 38, \"sorry\": 39, \"job\": 40, \"well\": 41, \"movie\": 42, \"should\": 43, \"watch\": 44, \"best\": 45, \"movies\": 46, \"recommendations\": 47, \"address\": 48, \"taking\": 49, \"remind\": 50, \"stopwatch\": 51, \"book\": 52, \"read\": 53, \"travel\": 54, \"study\": 55, \"pet\": 56, \"shopping\": 57, \"career\": 58, \"relationship\": 59, \"howdy\": 60, \"greetings\": 61, \"morning\": 62, \"afternoon\": 63, \"evening\": 64, \"what's\": 65, \"up\": 66, \"goodbye\": 67, \"farewell\": 68, \"until\": 69, \"next\": 70, \"catch\": 71, \"appreciate\": 72, \"so\": 73, \"lot\": 74, \"appreciated\": 75, \"apologies\": 76, \"apologize\": 77, \"i'm\": 78, \"great\": 79, \"done\": 80, \"awesome\": 81, \"fantastic\": 82, \"amazing\": 83, \"work\": 84, \"excellent\": 85, \"not\": 86, \"disappointed\": 87, \"unsatisfied\": 88, \"poor\": 89, \"service\": 90, \"needs\": 91, \"improvement\": 92, \"could\": 93, \"be\": 94, \"better\": 95, \"need\": 96, \"movi\": 97, \"show\": 98, \"series\": 99, \"on\": 100, \"shows\": 101, \"is\": 102, \"lookup\": 103, \"find\": 104, \"information\": 105, \"send\": 106, \"an\": 107, \"issues\": 108, \"create\": 109, \"write\": 110, \"set\": 111, \"reminder\": 112, \"schedule\": 113, \"reminders\": 114, \"start\": 115, \"timer\": 116, \"measure\": 117, \"elapsed\": 118, \"math\": 119, \"solve\": 120, \"equations\": 121, \"mathematics\": 122, \"calculate\": 123, \"books\": 124, \"fitness\": 125, \"workout\": 126, \"exercise\": 127, \"healthy\": 128, \"habits\": 129, \"places\": 130, \"visit\": 131, \"destination\": 132, \"ideas\": 133, \"resources\": 134, \"education\": 135, \"academic\": 136, \"animal\": 137, \"of\": 138, \"pets\": 139, \"online\": 140, \"buying\": 141, \"something\": 142, \"product\": 143, \"search\": 144, \"guidance\": 145, \"change\": 146, \"professional\": 147, \"development\": 148, \"love\": 149, \"dating\": 150, \"problems\": 151, \"mental\": 152, \"coping\": 153, \"strategies\": 154, \"stress\": 155, \"relief\": 156, \"emotional\": 157, \"being\": 158, \"practice\": 159, \"new\": 160, \"languages\": 161, \"financial\": 162, \"planning\": 163, \"money\": 164, \"management\": 165, \"investment\": 166, \"budgeting\": 167, \"none\": 168, \"leave\": 169, \"no\": 170, \"nothing\": 171}"}}